In [1]:
# study_DataScienceSchool_pandas03_고급인덱싱

###### loc: 라벨값 기반의 2차원 인덱싱
###### iloc: 순서를 나타내는 정수 기반의 2차원 인덱싱

#### loc 인덱서

In [1]:
# df.loc[행 인덱싱 값]
# df.loc[행 인덱싱 값, 열 인덱싱 값]

In [12]:
import pandas as pd
import numpy as np

In [27]:
df = pd.DataFrame(np.arange(10,22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=['A', 'B', 'C', 'D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

#### 인덱싱값을 하나만 받는 경우

In [14]:
df.loc["a"]

a    10
b    11
c    12
d    13
Name: a, dtype: int32

In [15]:
df.loc["b":"c"]

    a   b   c   d
b  14  15  16  17
c  18  19  20  21

In [16]:
df["b":"c"]

    a   b   c   d
b  14  15  16  17
c  18  19  20  21

In [17]:
df.loc[["b", "c"]]

    a   b   c   d
b  14  15  16  17
c  18  19  20  21

In [18]:
# df[["b", "c"]]  # KeyError

In [28]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [29]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [21]:
def select_rows(df):
    return df.a > 15

In [22]:
select_rows(df)

a    False
b    False
c     True
Name: a, dtype: bool

In [23]:
df.loc[select_rows(df)]

    a   b   c   d
c  18  19  20  21

In [24]:
## loc 인덱서가 없는 경우에 사용했던 라벨 인덱싱이나 라벨 리스트 인덱싱은 불가능하다.

# df.loc["A"]   # keyError
# df.loc[["A","B"]]   # keyError

In [25]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4), columns=["A","B","C","D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [26]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

#### 인덱싱값을 행과 열 모두 받는 경우

In [30]:
df.loc["a", "A"]

10

In [31]:
df.loc["b":,"A"]

b    14
c    18
Name: A, dtype: int32

In [34]:
df.loc["a", :]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [36]:
df.loc[["a","b"], ["B","D"]]

    B   D
a  11  13
b  15  17

In [37]:
# 행 인덱스가 같은 불리언 시리즈나 이러한 불리언 시리즈를 반환하는 함수도 행의 인덱싱값이 될 수 있다.
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

#### iloc인덱서

In [38]:
## iloc인데서는 loc와 반대로 라벨이 아니라 순서를 나타내는 정수(integer) 인덱스만 받는다. 다른 사항은 loc와 동일.

In [42]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [39]:
df.iloc[0,1]

11

In [40]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [41]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [43]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [44]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [45]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

### 연습문제

In [51]:
# 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터 프레임을 만든다. 

db = pd.DataFrame(np.arange(10, 35).reshape(5, 5), 
                  index = ["A", "B", "X", "Y", "Z"],
                  columns = ["a", "b", "x" ,"y", "z"])
db

    a   b   x   y   z
A  10  11  12  13  14
B  15  16  17  18  19
X  20  21  22  23  24
Y  25  26  27  28  29
Z  30  31  32  33  34

In [52]:
db.loc[["A"]]

    a   b   x   y   z
A  10  11  12  13  14

In [56]:
db.loc["B"]

a    15
b    16
x    17
y    18
z    19
Name: B, dtype: int32

In [63]:
df.iloc[2:3]

    A   B   C   D
c  36  38  40  42

In [64]:
df.iloc[2, :]

A    36
B    38
C    40
D    42
Name: c, dtype: int32